"use strict";

export const baseTerms = [
  {
    title: "bug",
    description: `Не бойтесь делать ошибки. Это путь к успеху.
      Не бойтесь делать ошибки. Это путь к успеху. Не бойтесь делать ошибки.
      Это путь к успеху. Не бойтесь делать ошибки. Это путь к успеху.
      Не бойтесь делать ошибки.
       Это путь к 
       успеху.`,
  },
  {
    title: "feature",
    description: `Не бойтесь делать ошибки. Это путь к успеху.
  Не бойпеху. Не бойтесь делать ошибки.
  Это путь к успеху. Не бойтесь делать ошибки. Это путь к успеху.
  Не бойтесь делать ошибки.
   Это путь к 
   успеху.`,
  },
  {
    title: "commit",
    description: `Не бойтесь делать ошибки. Это путь к успеху.
  Не бойтесь делать ошибки. Эт путь к успеху.
  Не бойтесь делать ошибки.
   Это путь к 
   успеху.`,
  },
];
