"use strict";

export const baseTerms = [
  {
    title: "stub",
    description: "Программный модуль, временно подменяющий реальную процедуру другой версией, предусматривающей возможность передачи параметров вызываемой процедуры через сеть в «прозрачном» режиме",
  },
  {
    title: "token",
    description: "Контролируемое пользователем устройство (например диск, смарт-карта, компьютерный файл), содержа­щее информацию, которая может использоваться в электронной торгов­ле для аутентификации или управления доступом",
  },
  {
    title: "LMS",
    description: "Cистема управления обучением. Информационная система, предназначенная для обеспечения административной и технической поддержки процессов, связанных с электронным обучением",
  },
  {
    title: "parser",
    description: "Cинтаксический анализатор. Инструментальное программное средство, которое анализирует программы или другие тексты и часто является первым этапом ассемблирования, компиляции, интерпретации или более сложного анализа",
  },
  {
    title: "server",
    description: "В вычислительной сети — функциональное устройство, предоставляющее услуги рабочим станциям, персональным компьюте­рам или другим функциональным устройствам",
  },
  {
    title: "session",
    description: "Cеанс. Совокупность действий, которые происходят в процессе установления, поддержания и разъединения соединения в вычислитель­ной сети",
  },
  {
    title: "pixel",
    description: "Наименьший элемент экрана, способный обеспечить полные функциональные возможности дисплея (т. е. цвет и шкалу яркости)",
  },
  {
    title: "client",
    description: "Функциональное устройство, получающее услуги от сервера",
  },
  {
    title: "integration",
    description: "Объединение отдельных элементов в единое целое",
  },
  {
    title: "index",
    description: "Целое число, определяющее место элемента данных в последовательности элементов данных",
  },
];
