"use strict";

export const baseTerms = [
  {
    title: "stub",
    description: "Программный модуль, временно подменяющий реальную процедуру другой версией, предусматривающей возможность передачи параметров вызываемой процедуры через сеть в «прозрачном» режиме",
  },
  {
    title: "token",
    description: "Контролируемое пользователем устройство (например диск, смарт-карта, компьютерный файл), содержа­щее информацию, которая может использоваться в электронной торгов­ле для аутентификации или управления доступом",
  },
  {
    title: "LMS",
    description: "Cистема управления обучением. Информационная система, предназначенная для обеспечения административной и технической поддержки процессов, связанных с электронным обучением",
  },
  {
    title: "parser",
    description: "Cинтаксический анализатор. Инструментальное программное средство, которое анализирует программы или другие тексты и часто является первым этапом ассемблирования, компиляции, интерпретации или более сложного анализа",
  },
  {
    title: "server",
    description: "В вычислительной сети — функциональное устройство, предоставляющее услуги рабочим станциям, персональным компьюте­рам или другим функциональным устройствам",
  },
  {
    title: "session",
    description: "Cеанс. Совокупность действий, которые происходят в процессе установления, поддержания и разъединения соединения в вычислитель­ной сети",
  },
  {
    title: "pixel",
    description: "Наименьший элемент экрана, способный обеспечить полные функциональные возможности дисплея (т. е. цвет и шкалу яркости)",
  },
  {
    title: "client",
    description: "Функциональное устройство, получающее услуги от сервера",
  },
  {
    title: "integration",
    description: "Объединение отдельных элементов в единое целое",
  },
  {
    title: "index",
    description: "Целое число, определяющее место элемента данных в последовательности элементов данных",
  },
  {
    title: "external",
    description: "Внешний объект, объявленный в некотором программном модуле и доступный вне его",
  },
  {
    title: "error recovery",
    description: "Способность продолжать работу после обнаружения ошибки",
  },
  {
    title: "cycle time",
    description: "Время цикла, минимальный временной интервал, между моментами начала последовательных циклов считывания-записи в запоминающем устройстве",
  },
  {
    title: "call",
    description: "Обращение абонента к ресурсам системы обработки информации или другим абонентам",
  },
  {
    title: "global",
    description: "Языковой объект, доступный в программном блоке, но объявленный вне его в том же программном модуле",
  },
  {
    title: "loader",
    description: "Программа, копирующая другие программы из внешней памяти во внутреннюю память, или данные из внешней памяти в внутреннюю и из внутренней памяти в регистры",
  },
  {
    title: "search key",
    description: "Ключ, который используется для поиска данных",
  },
  {
    title: "content",
    description: "Содержание, мультимедийный продукт (например, телевизионная программа)",
  },
  {
    title: "cursor",
    description: "Перемещаемая видимая отметка, используемая для указания позиции на поверхности визуализации, над которой будет осуществляться следующая операция",
  },
  {
    title: "modularity",
    description: "Организация программы в виде относительно независимых частей — модулей; чем больше независимость модулей, тем больше модульность",
  },
];
